app/views/games/_form.html.erb

SELECT "game_types".* FROM "game_types"
---
      <p>Genre</p>
      <%= f.collection_check_boxes :game_type_ids, GameType.all, :id, :name do |b| %>

SELECT "rarities".* FROM "rarities" ORDER BY "rarities"."id" ASC
---
      <p>Rarity</p>
      <%= f.collection_select :rarity_id, Rarity.order(:id),:id,:name, include_blank: true, presence: true  %>