app/views/games/_form.html.erb

      <p>Developer</p>
      <%= f.collection_select :developer_id, Developer.order(:name),:id,:name, include_blank: true, presence: true %>
---
SELECT "developers".* FROM "developers" ORDER BY "developers"."name" ASC

      <p>Franchise</p>
      <%= f.collection_select :franchise_id, Franchise.order(:name),:id,:name, include_blank: true, presence: true  %>
---
SELECT "franchises".* FROM "franchises" ORDER BY "franchises"."name" ASC

      <p>Platform</p>
      <%= f.collection_select :platform_id, Platform.order(:name),:id,:name, include_blank: true, presence: true  %>
---
SELECT "platforms".* FROM "platforms" ORDER BY "platforms"."name" ASC