app/helpers/games_helper.rb

SELECT "game_types".* FROM "game_types" INNER JOIN "game_types_games" ON "game_types"."id" = "game_types_games"."game_type_id" WHERE "game_types_games"."game_id" = $1  [["game_id", 1]]
---
  def showGenre(game)
    game.game_types.map(&:name).join(", ")