app/controllers/games_controller.rb

SELECT "game_types".* FROM "game_types" WHERE 1=0
---
  def index
    @games = Game.all
    if params["search"]
      @filter = params["search"]["platform"]
                    .concat(params["search"]["game_type"])
                    .concat(params["search"]["developer"])
                    .concat(params["search"]["franchise"])
                    .concat(params["search"]["rarity"])
                    .flatten.reject(&:blank?)
      @filter.each do |filter|
        @games = @games.tagged_with(filter, any: true)
      end
    else
      @games = Game.all