app/controllers/games_controller.rb

SELECT "games".* FROM "games"
---
  def home
    @games = Game.all

SELECT "games".* FROM "games" WHERE "games"."title" = $1 LIMIT $2  [["title", "Doom"], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @game = Game.find_by(title: params[:id])
    if @game == nil
      @game = Game.find(params[:id])

INSERT INTO "games" ("title", "about", "stock", "release_date", "developer_id", "franchise_id", "platform_id", "created_at", "updated_at", "rarity_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    verify_user
    @game = Game.new(game_params)
    if @game.valid?
      @game.save