app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "asdf"], ["description", "asdf"], ["created_at", "2020-03-14 14:29:48.737881"], ["updated_at", "2020-03-14 14:29:48.737881"]]